GopalSaraf/Practicals/PSDL/include/proc/pic18lf47k40.inc
// Register: PCL
#define PCL PCL
PCL                                      equ 0FF9h
// bitfield definitions
PCL_PCL_POSN                             equ 0000h
PCL_PCL_POSITION                         equ 0000h
PCL_PCL_SIZE                             equ 0008h
PCL_PCL_LENGTH                           equ 0008h
PCL_PCL_MASK                             equ 00FFh

// Register: PCLATH
#define PCLATH PCLATH
PCLATH                                   equ 0FFAh
// bitfield definitions
PCLATH_PCH_POSN                          equ 0000h
PCLATH_PCH_POSITION                      equ 0000h
PCLATH_PCH_SIZE                          equ 0008h
PCLATH_PCH_LENGTH                        equ 0008h
PCLATH_PCH_MASK                          equ 00FFh

// Register: PCLATU
#define PCLATU PCLATU
PCLATU                                   equ 0FFBh
// bitfield definitions
PCLATU_PCU_POSN                          equ 0000h
PCLATU_PCU_POSITION                      equ 0000h
PCLATU_PCU_SIZE                          equ 0005h
PCLATU_PCU_LENGTH                        equ 0005h
PCLATU_PCU_MASK                          equ 001Fh

// Register: STKPTR
#define STKPTR STKPTR
STKPTR                                   equ 0FFCh
// bitfield definitions
STKPTR_STKPTR_POSN                       equ 0000h
STKPTR_STKPTR_POSITION                   equ 0000h
STKPTR_STKPTR_SIZE                       equ 0006h
STKPTR_STKPTR_LENGTH                     equ 0006h
STKPTR_STKPTR_MASK                       equ 003Fh
STKPTR_STKPTR0_POSN                      equ 0000h
STKPTR_STKPTR0_POSITION                  equ 0000h
STKPTR_STKPTR0_SIZE                      equ 0001h
STKPTR_STKPTR0_LENGTH                    equ 0001h
STKPTR_STKPTR0_MASK                      equ 0001h
STKPTR_STKPTR1_POSN                      equ 0001h
STKPTR_STKPTR1_POSITION                  equ 0001h
STKPTR_STKPTR1_SIZE                      equ 0001h
STKPTR_STKPTR1_LENGTH                    equ 0001h
STKPTR_STKPTR1_MASK                      equ 0002h
STKPTR_STKPTR2_POSN                      equ 0002h
STKPTR_STKPTR2_POSITION                  equ 0002h
STKPTR_STKPTR2_SIZE                      equ 0001h
STKPTR_STKPTR2_LENGTH                    equ 0001h
STKPTR_STKPTR2_MASK                      equ 0004h
STKPTR_STKPTR3_POSN                      equ 0003h
STKPTR_STKPTR3_POSITION                  equ 0003h
STKPTR_STKPTR3_SIZE                      equ 0001h
STKPTR_STKPTR3_LENGTH                    equ 0001h
STKPTR_STKPTR3_MASK                      equ 0008h
STKPTR_STKPTR4_POSN                      equ 0004h
STKPTR_STKPTR4_POSITION                  equ 0004h
STKPTR_STKPTR4_SIZE                      equ 0001h
STKPTR_STKPTR4_LENGTH                    equ 0001h
STKPTR_STKPTR4_MASK                      equ 0010h
STKPTR_STKPTR5_POSN                      equ 0005h
STKPTR_STKPTR5_POSITION                  equ 0005h
STKPTR_STKPTR5_SIZE                      equ 0001h
STKPTR_STKPTR5_LENGTH                    equ 0001h
STKPTR_STKPTR5_MASK                      equ 0020h
STKPTR_SP0_POSN                          equ 0000h
STKPTR_SP0_POSITION                      equ 0000h
STKPTR_SP0_SIZE                          equ 0001h
STKPTR_SP0_LENGTH                        equ 0001h
STKPTR_SP0_MASK                          equ 0001h
STKPTR_SP1_POSN                          equ 0001h
STKPTR_SP1_POSITION                      equ 0001h
STKPTR_SP1_SIZE                          equ 0001h
STKPTR_SP1_LENGTH                        equ 0001h
STKPTR_SP1_MASK                          equ 0002h
STKPTR_SP2_POSN                          equ 0002h
STKPTR_SP2_POSITION                      equ 0002h
STKPTR_SP2_SIZE                          equ 0001h
STKPTR_SP2_LENGTH                        equ 0001h
STKPTR_SP2_MASK                          equ 0004h
STKPTR_SP3_POSN                          equ 0003h
STKPTR_SP3_POSITION                      equ 0003h
STKPTR_SP3_SIZE                          equ 0001h
STKPTR_SP3_LENGTH                        equ 0001h
STKPTR_SP3_MASK                          equ 0008h
STKPTR_SP4_POSN                          equ 0004h
STKPTR_SP4_POSITION                      equ 0004h
STKPTR_SP4_SIZE                          equ 0001h
STKPTR_SP4_LENGTH                        equ 0001h
STKPTR_SP4_MASK                          equ 0010h
STKPTR_SP5_POSN                          equ 0005h
STKPTR_SP5_POSITION                      equ 0005h
STKPTR_SP5_SIZE                          equ 0001h
STKPTR_SP5_LENGTH                        equ 0001h
STKPTR_SP5_MASK                          equ 0020h

// Register: TOS
#define TOS TOS
TOS                                      equ 0FFDh

// Register: TOSL
#define TOSL TOSL
TOSL                                     equ 0FFDh
// bitfield definitions
TOSL_TOSL_POSN                           equ 0000h
TOSL_TOSL_POSITION                       equ 0000h
TOSL_TOSL_SIZE                           equ 0008h
TOSL_TOSL_LENGTH                         equ 0008h
TOSL_TOSL_MASK                           equ 00FFh

// Register: TOSH
#define TOSH TOSH
TOSH                                     equ 0FFEh
// bitfield definitions
TOSH_TOSH_POSN                           equ 0000h
TOSH_TOSH_POSITION                       equ 0000h
TOSH_TOSH_SIZE                           equ 0008h
TOSH_TOSH_LENGTH                         equ 0008h
TOSH_TOSH_MASK                           equ 00FFh

// Register: TOSU
#define TOSU TOSU
TOSU                                     equ 0FFFh

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 0FFFFFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 0FFh)
#endif
#define ABDEN1                           BANKMASK(BAUD1CON), 0, a
#define ABDEN2                           BANKMASK(BAUD2CON), 0, b
#define ABDOVF1                          BANKMASK(BAUD1CON), 7, a
#define ABDOVF2                          BANKMASK(BAUD2CON), 7, b
#define ACC0                             BANKMASK(CRCACCL), 0, a
#define ACC1                             BANKMASK(CRCACCL), 1, a
#define ACC10                            BANKMASK(CRCACCH), 2, a
#define ACC11                            BANKMASK(CRCACCH), 3, a
#define ACC12                            BANKMASK(CRCACCH), 4, a
#define ACC13                            BANKMASK(CRCACCH), 5, a
#define ACC14                            BANKMASK(CRCACCH), 6, a
#define ACC15                            BANKMASK(CRCACCH), 7, a
#define ACC2                             BANKMASK(CRCACCL), 2, a
#define ACC3                             BANKMASK(CRCACCL), 3, a
#define ACC4                             BANKMASK(CRCACCL), 4, a
#define ACC5                             BANKMASK(CRCACCL), 5, a
#define ACC6                             BANKMASK(CRCACCL), 6, a
#define ACC7                             BANKMASK(CRCACCL), 7, a
#define ACC8                             BANKMASK(CRCACCH), 0, a
#define ACC9                             BANKMASK(CRCACCH), 1, a
#define ACCM                             BANKMASK(CRCCON0), 4, a
#define ACKDT1                           BANKMASK(SSP1CON2), 5, a
#define ACKDT2                           BANKMASK(SSP2CON2), 5, b
#define ACKEN1                           BANKMASK(SSP1CON2), 4, a
#define ACKEN2                           BANKMASK(SSP2CON2), 4, b
#define ACKSTAT1                         BANKMASK(SSP1CON2), 6, a
#define ACKSTAT2                         BANKMASK(SSP2CON2), 6, b
#define ACSS                             BANKMASK(TBLPTRU), 5, a
#define ADACC0                           BANKMASK(ADACCL), 0, a
#define ADACC1                           BANKMASK(ADACCL), 1, a
#define ADACC10                          BANKMASK(ADACCH), 2, a
#define ADACC11                          BANKMASK(ADACCH), 3, a
#define ADACC12                          BANKMASK(ADACCH), 4, a
#define ADACC13                          BANKMASK(ADACCH), 5, a
#define ADACC14                          BANKMASK(ADACCH), 6, a
#define ADACC15                          BANKMASK(ADACCH), 7, a
#define ADACC2                           BANKMASK(ADACCL), 2, a
#define ADACC3                           BANKMASK(ADACCL), 3, a
#define ADACC4                           BANKMASK(ADACCL), 4, a
#define ADACC5                           BANKMASK(ADACCL), 5, a
#define ADACC6                           BANKMASK(ADACCL), 6, a
#define ADACC7                           BANKMASK(ADACCL), 7, a
#define ADACC8                           BANKMASK(ADACCH), 0, a
#define ADACC9                           BANKMASK(ADACCH), 1, a
#define ADACLR                           BANKMASK(ADCON2), 3, b
#define ADACQ0                           BANKMASK(ADACQ), 0, b
#define ADACQ1                           BANKMASK(ADACQ), 1, b
#define ADACQ2                           BANKMASK(ADACQ), 2, b
#define ADACQ3                           BANKMASK(ADACQ), 3, b
#define ADACQ4                           BANKMASK(ADACQ), 4, b
#define ADACQ5                           BANKMASK(ADACQ), 5, b
#define ADACQ6                           BANKMASK(ADACQ), 6, b
#define ADACQ7                           BANKMASK(ADACQ), 7, b
#define ADACT0                           BANKMASK(ADACT), 0, b
#define ADACT1                           BANKMASK(ADACT), 1, b
#define ADACT2                           BANKMASK(ADACT), 2, b
#define ADACT3                           BANKMASK(ADACT), 3, b
#define ADACT4                           BANKMASK(ADACT), 4, b
#define ADACTPPS0                        BANKMASK(ADACTPPS), 0, b
#define ADACTPPS1                        BANKMASK(ADACTPPS), 1, b
#define ADACTPPS2                        BANKMASK(ADACTPPS), 2, b
#define ADACTPPS3                        BANKMASK(ADACTPPS), 3, b
#define ADACTPPS4                        BANKMASK(ADACTPPS), 4, b
#define ADAOV                            BANKMASK(ADSTAT), 7, a
#define ADCAL                            BANKMASK(ADCON0), 7, a
#define ADCALC0                          BANKMASK(ADCON3), 4, b
#define ADCALC1                          BANKMASK(ADCON3), 5, b
#define ADCALC2                          BANKMASK(ADCON3), 6, b
#define ADCAP0                           BANKMASK(ADCAP), 0, b
#define ADCAP1                           BANKMASK(ADCAP), 1, b
#define ADCAP2                           BANKMASK(ADCAP), 2, b
#define ADCAP3                           BANKMASK(ADCAP), 3, b
#define ADCAP4                           BANKMASK(ADCAP), 4, b
#define ADCMD                            BANKMASK(PMD2), 5, b
#define ADCNT0                           BANKMASK(ADCNT), 0, a
#define ADCNT1                           BANKMASK(ADCNT), 1, a
#define ADCNT2                           BANKMASK(ADCNT), 2, a
#define ADCNT3                           BANKMASK(ADCNT), 3, a
#define ADCNT4                           BANKMASK(ADCNT), 4, a
#define ADCNT5                           BANKMASK(ADCNT), 5, a
#define ADCNT6                           BANKMASK(ADCNT), 6, a
#define ADCNT7                           BANKMASK(ADCNT), 7, a
#define ADCONT                           BANKMASK(ADCON0), 6, a
#define ADCRS0                           BANKMASK(ADCON2), 4, b
#define ADCRS1                           BANKMASK(ADCON2), 5, b
#define ADCRS2                           BANKMASK(ADCON2), 6, b
#define ADCS                             BANKMASK(ADCON0), 4, a
#define ADCS0                            BANKMASK(ADCLK), 0, b
#define ADCS1                            BANKMASK(ADCLK), 1, b
#define ADCS2                            BANKMASK(ADCLK), 2, b
#define ADCS3                            BANKMASK(ADCLK), 3, b
#define ADCS4                            BANKMASK(ADCLK), 4, b
#define ADCS5                            BANKMASK(ADCLK), 5, b
#define ADDSEN                           BANKMASK(ADCON1), 0, b
#define ADERR0                           BANKMASK(ADERRL), 0, a
#define ADERR1                           BANKMASK(ADERRL), 1, a
#define ADERR10                          BANKMASK(ADERRH), 2, a
#define ADERR11                          BANKMASK(ADERRH), 3, a
#define ADERR12                          BANKMASK(ADERRH), 4, a
#define ADERR13                          BANKMASK(ADERRH), 5, a
#define ADERR14                          BANKMASK(ADERRH), 6, a
#define ADERR15                          BANKMASK(ADERRH), 7, a
#define ADERR2                           BANKMASK(ADERRL), 2, a
#define ADERR3                           BANKMASK(ADERRL), 3, a
#define ADERR4                           BANKMASK(ADERRL), 4, a
#define ADERR5                           BANKMASK(ADERRL), 5, a
#define ADERR6                           BANKMASK(ADERRL), 6, a
#define ADERR7                           BANKMASK(ADERRL), 7, a
#define ADERR8                           BANKMASK(ADERRH), 0, a
#define ADERR9                           BANKMASK(ADERRH), 1, a
#define ADFLTR0                          BANKMASK(ADFLTRL), 0, a
#define ADFLTR1                          BANKMASK(ADFLTRL), 1, a
#define ADFLTR10                         BANKMASK(ADFLTRH), 2, a
#define ADFLTR11                         BANKMASK(ADFLTRH), 3, a
#define ADFLTR12                         BANKMASK(ADFLTRH), 4, a
#define ADFLTR13                         BANKMASK(ADFLTRH), 5, a
#define ADFLTR14                         BANKMASK(ADFLTRH), 6, a
#define ADFLTR15                         BANKMASK(ADFLTRH), 7, a
#define ADFLTR2                          BANKMASK(ADFLTRL), 2, a
#define ADFLTR3                          BANKMASK(ADFLTRL), 3, a
#define ADFLTR4                          BANKMASK(ADFLTRL), 4, a
#define ADFLTR5                          BANKMASK(ADFLTRL), 5, a
#define ADFLTR6                          BANKMASK(ADFLTRL), 6, a
#define ADFLTR7                          BANKMASK(ADFLTRL), 7, a
#define ADFLTR8                          BANKMASK(ADFLTRH), 0, a
#define ADFLTR9                          BANKMASK(ADFLTRH), 1, a
#define ADFM                             BANKMASK(ADCON0), 2, a
#define ADFM0                            BANKMASK(ADCON0), 2, a
#define ADFVR0                           BANKMASK(FVRCON), 0, b
#define ADFVR1                           BANKMASK(FVRCON), 1, b
#define ADGO                             BANKMASK(ADCON0), 0, a
#define ADGPOL                           BANKMASK(ADCON1), 5, b
#define ADIE                             BANKMASK(PIE1), 0, b
#define ADIF                             BANKMASK(PIR1), 0, b
#define ADIP                             BANKMASK(IPR1), 0, b
#define ADIPEN                           BANKMASK(ADCON1), 6, b
#define ADLTH0                           BANKMASK(ADLTHL), 0, a
#define ADLTH1                           BANKMASK(ADLTHL), 1, a
#define ADLTH10                          BANKMASK(ADLTHH), 2, a
#define ADLTH11                          BANKMASK(ADLTHH), 3, a
#define ADLTH12                          BANKMASK(ADLTHH), 4, a
#define ADLTH13                          BANKMASK(ADLTHH), 5, a
#define ADLTH14                          BANKMASK(ADLTHH), 6, a
#define ADLTH15                          BANKMASK(ADLTHH), 7, a
#define ADLTH2                           BANKMASK(ADLTHL), 2, a
#define ADLTH3                           BANKMASK(ADLTHL), 3, a
#define ADLTH4                           BANKMASK(ADLTHL), 4, a
#define ADLTH5                           BANKMASK(ADLTHL), 5, a
#define ADLTH6                           BANKMASK(ADLTHL), 6, a
#define ADLTH7                           BANKMASK(ADLTHL), 7, a
#define ADLTH8                           BANKMASK(ADLTHH), 0, a
#define ADLTH9                           BANKMASK(ADLTHH), 1, a
#define ADLTHR                           BANKMASK(ADSTAT), 5, a
#define ADMATH                           BANKMASK(ADSTAT), 4, a
#define ADMD0                            BANKMASK(ADCON2), 0, b
#define ADMD1                            BANKMASK(ADCON2), 1, b
#define ADMD2                            BANKMASK(ADCON2), 2, b
#define ADMSK11                          BANKMASK(SSP1CON2), 1, a
#define ADMSK12                          BANKMASK(SSP2CON2), 1, b
#define ADMSK21                          BANKMASK(SSP1CON2), 2, a
#define ADMSK22                          BANKMASK(SSP2CON2), 2, b
#define ADMSK31                          BANKMASK(SSP1CON2), 3, a
#define ADMSK32                          BANKMASK(SSP2CON2), 3, b
#define ADMSK41                          BANKMASK(SSP1CON2), 4, a
#define ADMSK42                          BANKMASK(SSP2CON2), 4, b
#define ADMSK51                          BANKMASK(SSP1CON2), 5, a
#define ADMSK52                          BANKMASK(SSP2CON2), 5, b
#define ADNREF                           BANKMASK(ADREF), 4, b
#define ADOEN                            BANKMASK(OSCEN), 2, b
#define ADON                             BANKMASK(ADCON0), 7, a
#define ADOR                             BANKMASK(OSCSTAT), 2, b
#define ADPCH0                           BANKMASK(ADPCH), 0, b
#define ADPCH1                           BANKMASK(ADPCH), 1, b
#define ADPCH2                           BANKMASK(ADPCH), 2, b
#define ADPCH3                           BANKMASK(ADPCH), 3, b
#define ADPCH4                           BANKMASK(ADPCH), 4, b
#define ADPCH5                           BANKMASK(ADPCH), 5, b
#define ADPPOL                           BANKMASK(ADCON1), 7, b
#define ADPRE0                           BANKMASK(ADPRE), 0, b
#define ADPRE1                           BANKMASK(ADPRE), 1, b
#define ADPRE2                           BANKMASK(ADPRE), 2, b
#define ADPRE3                           BANKMASK(ADPRE), 3, b
#define ADPRE4                           BANKMASK(ADPRE), 4, b
#define ADPRE5                           BANKMASK(ADPRE), 5, b
#define ADPRE6                           BANKMASK(ADPRE), 6, b
#define ADPRE7                           BANKMASK(ADPRE), 7, b
#define ADPREF0                          BANKMASK(ADREF), 0, b
#define ADPREF1                          BANKMASK(ADREF), 1, b
#define ADPREV0                          BANKMASK(ADPREVL), 0, a
#define ADPREV1                          BANKMASK(ADPREVL), 1, a
#define ADPREV10                         BANKMASK(ADPREVH), 2, a
#define ADPREV11                         BANKMASK(ADPREVH), 3, a
#define ADPREV12                         BANKMASK(ADPREVH), 4, a
#define ADPREV13                         BANKMASK(ADPREVH), 5, a
#define ADPREV14                         BANKMASK(ADPREVH), 6, a
#define ADPREV15                         BANKMASK(ADPREVH), 7, a
#define ADPREV2                          BANKMASK(ADPREVL), 2, a
#define ADPREV3                          BANKMASK(ADPREVL), 3, a
#define ADPREV4                          BANKMASK(ADPREVL), 4, a
#define ADPREV5                          BANKMASK(ADPREVL), 5, a
#define ADPREV6                          BANKMASK(ADPREVL), 6, a
#define ADPREV7                          BANKMASK(ADPREVL), 7, a
#define ADPREV8                          BANKMASK(ADPREVH), 0, a
#define ADPREV9                          BANKMASK(ADPREVH), 1, a
#define ADPSIS                           BANKMASK(ADCON2), 7, b
#define ADR0                             BANKMASK(NVMADRL), 0, a
#define ADR1                             BANKMASK(NVMADRL), 1, a
#define ADR2                             BANKMASK(NVMADRL), 2, a
#define ADR3                             BANKMASK(NVMADRL), 3, a
#define ADR4                             BANKMASK(NVMADRL), 4, a
#define ADR5                             BANKMASK(NVMADRL), 5, a
#define ADR6                             BANKMASK(NVMADRL), 6, a
#define ADR7                             BANKMASK(NVMADRL), 7, a
#define ADR8                             BANKMASK(NVMADRH), 0, a
#define ADR9                             BANKMASK(NVMADRH), 1, a
#define ADRES0                           BANKMASK(ADRESL), 0, a
#define ADRES1                           BANKMASK(ADRESL), 1, a
#define ADRES10                          BANKMASK(ADRESH), 2, a
#define ADRES11                          BANKMASK(ADRESH), 3, a
#define ADRES12                          BANKMASK(ADRESH), 4, a
#define ADRES13                          BANKMASK(ADRESH), 5, a
#define ADRES14                          BANKMASK(ADRESH), 6, a
#define ADRES15                          BANKMASK(ADRESH), 7, a
#define ADRES2                           BANKMASK(ADRESL), 2, a
#define ADRES3                           BANKMASK(ADRESL), 3, a
#define ADRES4                           BANKMASK(ADRESL), 4, a
#define ADRES5                           BANKMASK(ADRESL), 5, a
#define ADRES6                           BANKMASK(ADRESL), 6, a
#define ADRES7                           BANKMASK(ADRESL), 7, a
#define ADRES8                           BANKMASK(ADRESH), 0, a
#define ADRES9                           BANKMASK(ADRESH), 1, a
#define ADRPT0                           BANKMASK(ADRPT), 0, a
#define ADRPT1                           BANKMASK(ADRPT), 1, a
#define ADRPT2                           BANKMASK(ADRPT), 2, a
#define ADRPT3                           BANKMASK(ADRPT), 3, a
#define ADRPT4                           BANKMASK(ADRPT), 4, a
#define ADRPT5                           BANKMASK(ADRPT), 5, a
#define ADRPT6                           BANKMASK(ADRPT), 6, a
#define ADRPT7                           BANKMASK(ADRPT), 7, a
#define ADSOI                            BANKMASK(ADCON3), 3, b
#define ADSTAT0                          BANKMASK(ADSTAT), 0, a
#define ADSTAT1                          BANKMASK(ADSTAT), 1, a
#define ADSTAT2                          BANKMASK(ADSTAT), 2, a
#define ADSTPT0                          BANKMASK(ADSTPTL), 0, a
#define ADSTPT1                          BANKMASK(ADSTPTL), 1, a
#define ADSTPT10                         BANKMASK(ADSTPTH), 2, a
#define ADSTPT11                         BANKMASK(ADSTPTH), 3, a
#define ADSTPT12                         BANKMASK(ADSTPTH), 4, a
#define ADSTPT13                         BANKMASK(ADSTPTH), 5, a
#define ADSTPT14                         BANKMASK(ADSTPTH), 6, a
#define ADSTPT15                         BANKMASK(ADSTPTH), 7, a
#define ADSTPT2                          BANKMASK(ADSTPTL), 2, a
#define ADSTPT3                          BANKMASK(ADSTPTL), 3, a
#define ADSTPT4                          BANKMASK(ADSTPTL), 4, a
#define ADSTPT5                          BANKMASK(ADSTPTL), 5, a
#define ADSTPT6                          BANKMASK(ADSTPTL), 6, a
#define ADSTPT7                          BANKMASK(ADSTPTL), 7, a
#define ADSTPT8                          BANKMASK(ADSTPTH), 0, a
#define ADSTPT9                          BANKMASK(ADSTPTH), 1, a
#define ADTIE                            BANKMASK(PIE1), 1, b
#define ADTIF                            BANKMASK(PIR1), 1, b
#define ADTIP                            BANKMASK(IPR1), 1, b
#define ADTMD0                           BANKMASK(ADCON3), 0, b
#define ADTMD1                           BANKMASK(ADCON3), 1, b
#define ADTMD2                           BANKMASK(ADCON3), 2, b
#define ADUTH0                           BANKMASK(ADUTHL), 0, a
#define ADUTH1                           BANKMASK(ADUTHL), 1, a
#define ADUTH10                          BANKMASK(ADUTHH), 2, a
#define ADUTH11                          BANKMASK(ADUTHH), 3, a
#define ADUTH12                          BANKMASK(ADUTHH), 4, a
#define ADUTH13                          BANKMASK(ADUTHH), 5, a
#define ADUTH14                          BANKMASK(ADUTHH), 6, a
#define ADUTH15                          BANKMASK(ADUTHH), 7, a
#define ADUTH2                           BANKMASK(ADUTHL), 2, a
#define ADUTH3                           BANKMASK(ADUTHL), 3, a
#define ADUTH4                           BANKMASK(ADUTHL), 4, a
#define ADUTH5                           BANKMASK(ADUTHL), 5, a
#define ADUTH6                           BANKMASK(ADUTHL), 6, a
#define ADUTH7                           BANKMASK(ADUTHL), 7, a
#define ADUTH8                           BANKMASK(ADUTHH), 0, a
#define ADUTH9                           BANKMASK(ADUTHH), 1, a
#define ADUTHR                           BANKMASK(ADSTAT), 6, a
#define ANSELA0                          BANKMASK(ANSELA), 0, b
#define ANSELA1                          BANKMASK(ANSELA), 1, b
#define ANSELA2                          BANKMASK(ANSELA), 2, b
#define ANSELA3                          BANKMASK(ANSELA), 3, b
