GopalSaraf/Practicals/PSDL/include/proc/pic18lf47k40.inc
#define T5GPOL                           BANKMASK(T5GCON), 6, a
#define T5GPPS0                          BANKMASK(T5GPPS), 0, b
#define T5GPPS1                          BANKMASK(T5GPPS), 1, b
#define T5GPPS2                          BANKMASK(T5GPPS), 2, b
#define T5GPPS3                          BANKMASK(T5GPPS), 3, b
#define T5GPPS4                          BANKMASK(T5GPPS), 4, b
#define T5GSPM                           BANKMASK(T5GCON), 4, a
#define T5GSS0                           BANKMASK(T5GATE), 0, a
#define T5GSS1                           BANKMASK(T5GATE), 1, a
#define T5GSS2                           BANKMASK(T5GATE), 2, a
#define T5GSS3                           BANKMASK(T5GATE), 3, a
#define T5GTM                            BANKMASK(T5GCON), 5, a
#define T5GVAL                           BANKMASK(T5GCON), 2, a
#define T5RD16                           BANKMASK(T5CON), 1, a
#define T6CKPOL                          BANKMASK(T6HLT), 6, a
#define T6CKPS0                          BANKMASK(T6CON), 4, a
#define T6CKPS1                          BANKMASK(T6CON), 5, a
#define T6CKPS2                          BANKMASK(T6CON), 6, a
#define T6CKSYNC                         BANKMASK(T6HLT), 5, a
#define T6CS0                            BANKMASK(T6CLKCON), 0, a
#define T6CS1                            BANKMASK(T6CLKCON), 1, a
#define T6CS2                            BANKMASK(T6CLKCON), 2, a
#define T6CS3                            BANKMASK(T6CLKCON), 3, a
#define T6INPPS0                         BANKMASK(T6INPPS), 0, b
#define T6INPPS1                         BANKMASK(T6INPPS), 1, b
#define T6INPPS2                         BANKMASK(T6INPPS), 2, b
#define T6INPPS3                         BANKMASK(T6INPPS), 3, b
#define T6INPPS4                         BANKMASK(T6INPPS), 4, b
#define T6MODE0                          BANKMASK(T6HLT), 0, a
#define T6MODE1                          BANKMASK(T6HLT), 1, a
#define T6MODE2                          BANKMASK(T6HLT), 2, a
#define T6MODE3                          BANKMASK(T6HLT), 3, a
#define T6MODE4                          BANKMASK(T6HLT), 4, a
#define T6ON                             BANKMASK(T6CON), 7, a
#define T6OUTPS0                         BANKMASK(T6CON), 0, a
#define T6OUTPS1                         BANKMASK(T6CON), 1, a
#define T6OUTPS2                         BANKMASK(T6CON), 2, a
#define T6OUTPS3                         BANKMASK(T6CON), 3, a
#define T6PSYNC                          BANKMASK(T6HLT), 7, a
#define T6RSEL0                          BANKMASK(T6RST), 0, a
#define T6RSEL1                          BANKMASK(T6RST), 1, a
#define T6RSEL2                          BANKMASK(T6RST), 2, a
#define T6RSEL3                          BANKMASK(T6RST), 3, a
#define TMR0H0                           BANKMASK(TMR0H), 0, a
#define TMR0H1                           BANKMASK(TMR0H), 1, a
#define TMR0H2                           BANKMASK(TMR0H), 2, a
#define TMR0H3                           BANKMASK(TMR0H), 3, a
#define TMR0H4                           BANKMASK(TMR0H), 4, a
#define TMR0H5                           BANKMASK(TMR0H), 5, a
#define TMR0H6                           BANKMASK(TMR0H), 6, a
#define TMR0H7                           BANKMASK(TMR0H), 7, a
#define TMR0IE                           BANKMASK(PIE0), 5, b
#define TMR0IF                           BANKMASK(PIR0), 5, b
#define TMR0IP                           BANKMASK(IPR0), 5, b
#define TMR0L0                           BANKMASK(TMR0L), 0, a
#define TMR0L1                           BANKMASK(TMR0L), 1, a
#define TMR0L2                           BANKMASK(TMR0L), 2, a
#define TMR0L3                           BANKMASK(TMR0L), 3, a
#define TMR0L4                           BANKMASK(TMR0L), 4, a
#define TMR0L5                           BANKMASK(TMR0L), 5, a
#define TMR0L6                           BANKMASK(TMR0L), 6, a
#define TMR0L7                           BANKMASK(TMR0L), 7, a
#define TMR0MD                           BANKMASK(PMD1), 0, b
#define TMR10                            BANKMASK(TMR1L), 0, a
#define TMR11                            BANKMASK(TMR1L), 1, a
#define TMR110                           BANKMASK(TMR1H), 2, a
#define TMR111                           BANKMASK(TMR1H), 3, a
#define TMR112                           BANKMASK(TMR1H), 4, a
#define TMR113                           BANKMASK(TMR1H), 5, a
#define TMR114                           BANKMASK(TMR1H), 6, a
#define TMR115                           BANKMASK(TMR1H), 7, a
#define TMR12                            BANKMASK(TMR1L), 2, a
#define TMR13                            BANKMASK(TMR1L), 3, a
#define TMR14                            BANKMASK(TMR1L), 4, a
#define TMR15                            BANKMASK(TMR1L), 5, a
#define TMR16                            BANKMASK(TMR1L), 6, a
#define TMR17                            BANKMASK(TMR1L), 7, a
#define TMR18                            BANKMASK(TMR1H), 0, a
#define TMR19                            BANKMASK(TMR1H), 1, a
#define TMR1GIE                          BANKMASK(PIE5), 0, b
#define TMR1GIF                          BANKMASK(PIR5), 0, b
#define TMR1GIP                          BANKMASK(IPR5), 0, b
#define TMR1H0                           BANKMASK(TMR1H), 0, a
#define TMR1H1                           BANKMASK(TMR1H), 1, a
#define TMR1H2                           BANKMASK(TMR1H), 2, a
#define TMR1H3                           BANKMASK(TMR1H), 3, a
#define TMR1H4                           BANKMASK(TMR1H), 4, a
#define TMR1H5                           BANKMASK(TMR1H), 5, a
#define TMR1H6                           BANKMASK(TMR1H), 6, a
#define TMR1H7                           BANKMASK(TMR1H), 7, a
#define TMR1IE                           BANKMASK(PIE4), 0, b
#define TMR1IF                           BANKMASK(PIR4), 0, b
#define TMR1IP                           BANKMASK(IPR4), 0, b
#define TMR1L0                           BANKMASK(TMR1L), 0, a
#define TMR1L1                           BANKMASK(TMR1L), 1, a
#define TMR1L2                           BANKMASK(TMR1L), 2, a
#define TMR1L3                           BANKMASK(TMR1L), 3, a
#define TMR1L4                           BANKMASK(TMR1L), 4, a
#define TMR1L5                           BANKMASK(TMR1L), 5, a
#define TMR1L6                           BANKMASK(TMR1L), 6, a
#define TMR1L7                           BANKMASK(TMR1L), 7, a
#define TMR1MD                           BANKMASK(PMD1), 1, b
#define TMR1ON                           BANKMASK(T1CON), 0, a
#define TMR2IE                           BANKMASK(PIE4), 1, b
#define TMR2IF                           BANKMASK(PIR4), 1, b
#define TMR2IP                           BANKMASK(IPR4), 1, b
#define TMR2MD                           BANKMASK(PMD1), 2, b
#define TMR2ON                           BANKMASK(T2CON), 7, a
#define TMR30                            BANKMASK(TMR3L), 0, a
#define TMR31                            BANKMASK(TMR3L), 1, a
#define TMR310                           BANKMASK(TMR3H), 2, a
#define TMR311                           BANKMASK(TMR3H), 3, a
#define TMR312                           BANKMASK(TMR3H), 4, a
#define TMR313                           BANKMASK(TMR3H), 5, a
#define TMR314                           BANKMASK(TMR3H), 6, a
#define TMR315                           BANKMASK(TMR3H), 7, a
#define TMR32                            BANKMASK(TMR3L), 2, a
#define TMR33                            BANKMASK(TMR3L), 3, a
#define TMR34                            BANKMASK(TMR3L), 4, a
#define TMR35                            BANKMASK(TMR3L), 5, a
#define TMR36                            BANKMASK(TMR3L), 6, a
#define TMR37                            BANKMASK(TMR3L), 7, a
#define TMR38                            BANKMASK(TMR3H), 0, a
#define TMR39                            BANKMASK(TMR3H), 1, a
#define TMR3GIE                          BANKMASK(PIE5), 1, b
#define TMR3GIF                          BANKMASK(PIR5), 1, b
#define TMR3GIP                          BANKMASK(IPR5), 1, b
#define TMR3H0                           BANKMASK(TMR3H), 0, a
#define TMR3H1                           BANKMASK(TMR3H), 1, a
#define TMR3H2                           BANKMASK(TMR3H), 2, a
#define TMR3H3                           BANKMASK(TMR3H), 3, a
#define TMR3H4                           BANKMASK(TMR3H), 4, a
#define TMR3H5                           BANKMASK(TMR3H), 5, a
#define TMR3H6                           BANKMASK(TMR3H), 6, a
#define TMR3H7                           BANKMASK(TMR3H), 7, a
#define TMR3IE                           BANKMASK(PIE4), 2, b
#define TMR3IF                           BANKMASK(PIR4), 2, b
#define TMR3IP                           BANKMASK(IPR4), 2, b
#define TMR3L0                           BANKMASK(TMR3L), 0, a
#define TMR3L1                           BANKMASK(TMR3L), 1, a
#define TMR3L2                           BANKMASK(TMR3L), 2, a
#define TMR3L3                           BANKMASK(TMR3L), 3, a
#define TMR3L4                           BANKMASK(TMR3L), 4, a
#define TMR3L5                           BANKMASK(TMR3L), 5, a
#define TMR3L6                           BANKMASK(TMR3L), 6, a
#define TMR3L7                           BANKMASK(TMR3L), 7, a
#define TMR3MD                           BANKMASK(PMD1), 3, b
#define TMR3ON                           BANKMASK(T3CON), 0, a
#define TMR4IE                           BANKMASK(PIE4), 3, b
#define TMR4IF                           BANKMASK(PIR4), 3, b
#define TMR4IP                           BANKMASK(IPR4), 3, b
#define TMR4MD                           BANKMASK(PMD1), 4, b
#define TMR4ON                           BANKMASK(T4CON), 7, a
#define TMR50                            BANKMASK(TMR5L), 0, a
#define TMR51                            BANKMASK(TMR5L), 1, a
#define TMR510                           BANKMASK(TMR5H), 2, a
#define TMR511                           BANKMASK(TMR5H), 3, a
#define TMR512                           BANKMASK(TMR5H), 4, a
#define TMR513                           BANKMASK(TMR5H), 5, a
#define TMR514                           BANKMASK(TMR5H), 6, a
#define TMR515                           BANKMASK(TMR5H), 7, a
#define TMR52                            BANKMASK(TMR5L), 2, a
#define TMR53                            BANKMASK(TMR5L), 3, a
#define TMR54                            BANKMASK(TMR5L), 4, a
#define TMR55                            BANKMASK(TMR5L), 5, a
#define TMR56                            BANKMASK(TMR5L), 6, a
#define TMR57                            BANKMASK(TMR5L), 7, a
#define TMR58                            BANKMASK(TMR5H), 0, a
#define TMR59                            BANKMASK(TMR5H), 1, a
#define TMR5GIE                          BANKMASK(PIE5), 2, b
#define TMR5GIF                          BANKMASK(PIR5), 2, b
#define TMR5GIP                          BANKMASK(IPR5), 2, b
#define TMR5H0                           BANKMASK(TMR5H), 0, a
#define TMR5H1                           BANKMASK(TMR5H), 1, a
#define TMR5H2                           BANKMASK(TMR5H), 2, a
#define TMR5H3                           BANKMASK(TMR5H), 3, a
#define TMR5H4                           BANKMASK(TMR5H), 4, a
#define TMR5H5                           BANKMASK(TMR5H), 5, a
#define TMR5H6                           BANKMASK(TMR5H), 6, a
#define TMR5H7                           BANKMASK(TMR5H), 7, a
#define TMR5IE                           BANKMASK(PIE4), 4, b
#define TMR5IF                           BANKMASK(PIR4), 4, b
#define TMR5IP                           BANKMASK(IPR4), 4, b
#define TMR5L0                           BANKMASK(TMR5L), 0, a
#define TMR5L1                           BANKMASK(TMR5L), 1, a
#define TMR5L2                           BANKMASK(TMR5L), 2, a
#define TMR5L3                           BANKMASK(TMR5L), 3, a
#define TMR5L4                           BANKMASK(TMR5L), 4, a
#define TMR5L5                           BANKMASK(TMR5L), 5, a
#define TMR5L6                           BANKMASK(TMR5L), 6, a
#define TMR5L7                           BANKMASK(TMR5L), 7, a
#define TMR5MD                           BANKMASK(PMD1), 5, b
#define TMR5ON                           BANKMASK(T5CON), 0, a
#define TMR6IE                           BANKMASK(PIE4), 5, b
#define TMR6IF                           BANKMASK(PIR4), 5, b
#define TMR6IP                           BANKMASK(IPR4), 5, b
#define TMR6MD                           BANKMASK(PMD1), 6, b
#define TMR6ON                           BANKMASK(T6CON), 7, a
#define TO                               BANKMASK(STATUS), 6, a
#define TRISA0                           BANKMASK(TRISA), 0, a
#define TRISA1                           BANKMASK(TRISA), 1, a
#define TRISA2                           BANKMASK(TRISA), 2, a
#define TRISA3                           BANKMASK(TRISA), 3, a
#define TRISA4                           BANKMASK(TRISA), 4, a
#define TRISA5                           BANKMASK(TRISA), 5, a
#define TRISA6                           BANKMASK(TRISA), 6, a
#define TRISA7                           BANKMASK(TRISA), 7, a
#define TRISB0                           BANKMASK(TRISB), 0, a
#define TRISB1                           BANKMASK(TRISB), 1, a
#define TRISB2                           BANKMASK(TRISB), 2, a
#define TRISB3                           BANKMASK(TRISB), 3, a
#define TRISB4                           BANKMASK(TRISB), 4, a
#define TRISB5                           BANKMASK(TRISB), 5, a
#define TRISB6                           BANKMASK(TRISB), 6, a
#define TRISB7                           BANKMASK(TRISB), 7, a
#define TRISC0                           BANKMASK(TRISC), 0, a
#define TRISC1                           BANKMASK(TRISC), 1, a
#define TRISC2                           BANKMASK(TRISC), 2, a
#define TRISC3                           BANKMASK(TRISC), 3, a
#define TRISC4                           BANKMASK(TRISC), 4, a
#define TRISC5                           BANKMASK(TRISC), 5, a
#define TRISC6                           BANKMASK(TRISC), 6, a
#define TRISC7                           BANKMASK(TRISC), 7, a
#define TRISD0                           BANKMASK(TRISD), 0, a
#define TRISD1                           BANKMASK(TRISD), 1, a
#define TRISD2                           BANKMASK(TRISD), 2, a
#define TRISD3                           BANKMASK(TRISD), 3, a
#define TRISD4                           BANKMASK(TRISD), 4, a
#define TRISD5                           BANKMASK(TRISD), 5, a
#define TRISD6                           BANKMASK(TRISD), 6, a
#define TRISD7                           BANKMASK(TRISD), 7, a
#define TRISE0                           BANKMASK(TRISE), 0, a
#define TRISE1                           BANKMASK(TRISE), 1, a
#define TRISE2                           BANKMASK(TRISE), 2, a
#define TRMT1                            BANKMASK(TX1STA), 1, a
#define TSEL0                            BANKMASK(SCANTRIG), 0, b
#define TSEL1                            BANKMASK(SCANTRIG), 1, b
#define TSEL2                            BANKMASK(SCANTRIG), 2, b
#define TSEL3                            BANKMASK(SCANTRIG), 3, b
#define TSEN                             BANKMASK(FVRCON), 5, b
#define TSRNG                            BANKMASK(FVRCON), 4, b
#define TUN0                             BANKMASK(OSCTUNE), 0, b
#define TUN1                             BANKMASK(OSCTUNE), 1, b
#define TUN2                             BANKMASK(OSCTUNE), 2, b
#define TUN3                             BANKMASK(OSCTUNE), 3, b
#define TUN4                             BANKMASK(OSCTUNE), 4, b
#define TUN5                             BANKMASK(OSCTUNE), 5, b
#define TX1IE                            BANKMASK(PIE3), 4, b
#define TX1IF                            BANKMASK(PIR3), 4, b
#define TX1IP                            BANKMASK(IPR3), 4, b
#define TX1PPS0                          BANKMASK(CK1PPS), 0, b
#define TX1PPS1                          BANKMASK(CK1PPS), 1, b
#define TX1PPS2                          BANKMASK(CK1PPS), 2, b
#define TX1PPS3                          BANKMASK(CK1PPS), 3, b
#define TX1PPS4                          BANKMASK(CK1PPS), 4, b
#define TX2IE                            BANKMASK(PIE3), 6, b
#define TX2IF                            BANKMASK(PIR3), 6, b
#define TX2IP                            BANKMASK(IPR3), 6, b
#define TX8_9                            BANKMASK(TX1STA), 6, a
#define TX8_92                           BANKMASK(TX2STA), 6, b
#define TX91                             BANKMASK(TX1STA), 6, a
#define TX9D1                            BANKMASK(TX1STA), 0, a
#define TXB0IE                           BANKMASK(PIE3), 2, b
#define TXB1IE                           BANKMASK(PIE3), 3, b
#define TXB2IE                           BANKMASK(PIE3), 4, b
#define TXBNIE                           BANKMASK(PIE3), 4, b
#define TXBNIF                           BANKMASK(PIR3), 4, b
#define TXBNIP                           BANKMASK(IPR3), 4, b
#define TXCKP                            BANKMASK(BAUD1CON), 4, a
#define TXCKP1                           BANKMASK(BAUD1CON), 4, a
#define TXCKP2                           BANKMASK(BAUD2CON), 4, b
#define TXD8                             BANKMASK(TX1STA), 0, a
#define TXD82                            BANKMASK(TX2STA), 0, b
#define TXEN1                            BANKMASK(TX1STA), 5, a
#define UA1                              BANKMASK(SSP1STAT), 1, a
#define UA2                              BANKMASK(SSP2STAT), 1, b
#define UART1MD                          BANKMASK(PMD4), 6, b
#define UART2MD                          BANKMASK(PMD4), 7, b
#define ULPWUIN                          BANKMASK(PORTA), 0, a
#define W4E                              BANKMASK(BAUD1CON), 1, a
#define WCOL1                            BANKMASK(SSP1CON1), 7, a
#define WCOL2                            BANKMASK(SSP2CON1), 7, b
#define WDTCS0                           BANKMASK(WDTCON1), 4, b
#define WDTCS1                           BANKMASK(WDTCON1), 5, b
#define WDTCS2                           BANKMASK(WDTCON1), 6, b
#define WDTPS0                           BANKMASK(WDTCON0), 1, b
#define WDTPS1                           BANKMASK(WDTCON0), 2, b
#define WDTPS2                           BANKMASK(WDTCON0), 3, b
#define WDTPS3                           BANKMASK(WDTCON0), 4, b
#define WDTPS4                           BANKMASK(WDTCON0), 5, b
#define WDTPSCNT0                        BANKMASK(WDTPSL), 0, b
#define WDTPSCNT1                        BANKMASK(WDTPSL), 1, b
#define WDTPSCNT10                       BANKMASK(WDTPSH), 2, b
#define WDTPSCNT11                       BANKMASK(WDTPSH), 3, b
#define WDTPSCNT12                       BANKMASK(WDTPSH), 4, b
#define WDTPSCNT13                       BANKMASK(WDTPSH), 5, b
#define WDTPSCNT14                       BANKMASK(WDTPSH), 6, b
#define WDTPSCNT15                       BANKMASK(WDTPSH), 7, b
#define WDTPSCNT16                       BANKMASK(WDTTMR), 0, b
#define WDTPSCNT17                       BANKMASK(WDTTMR), 1, b
#define WDTPSCNT2                        BANKMASK(WDTPSL), 2, b
#define WDTPSCNT3                        BANKMASK(WDTPSL), 3, b
#define WDTPSCNT4                        BANKMASK(WDTPSL), 4, b
#define WDTPSCNT5                        BANKMASK(WDTPSL), 5, b
#define WDTPSCNT6                        BANKMASK(WDTPSL), 6, b
#define WDTPSCNT7                        BANKMASK(WDTPSL), 7, b
#define WDTPSCNT8                        BANKMASK(WDTPSH), 0, b
#define WDTPSCNT9                        BANKMASK(WDTPSH), 1, b
#define WDTSEN                           BANKMASK(WDTCON0), 0, b
#define WDTSTATE                         BANKMASK(WDTTMR), 2, b
#define WDTTMR0                          BANKMASK(WDTTMR), 3, b
#define WDTTMR1                          BANKMASK(WDTTMR), 4, b
#define WDTTMR2                          BANKMASK(WDTTMR), 5, b
#define WDTTMR3                          BANKMASK(WDTTMR), 6, b
#define WDTTMR4                          BANKMASK(WDTTMR), 7, b
#define WDTWINDOW0                       BANKMASK(WDTCON1), 0, b
#define WDTWINDOW1                       BANKMASK(WDTCON1), 1, b
#define WDTWINDOW2                       BANKMASK(WDTCON1), 2, b
#define WDTWV                            BANKMASK(PCON0), 5, a
#define WINDOW0                          BANKMASK(WDTCON1), 0, b
#define WINDOW1                          BANKMASK(WDTCON1), 1, b
#define WINDOW2                          BANKMASK(WDTCON1), 2, b
#define WPUA0                            BANKMASK(WPUA), 0, b
#define WPUA1                            BANKMASK(WPUA), 1, b
#define WPUA2                            BANKMASK(WPUA), 2, b
#define WPUA3                            BANKMASK(WPUA), 3, b
#define WPUA4                            BANKMASK(WPUA), 4, b
#define WPUA5                            BANKMASK(WPUA), 5, b
#define WPUA6                            BANKMASK(WPUA), 6, b
#define WPUA7                            BANKMASK(WPUA), 7, b
#define WPUB0                            BANKMASK(WPUB), 0, b
#define WPUB1                            BANKMASK(WPUB), 1, b
#define WPUB2                            BANKMASK(WPUB), 2, b
#define WPUB3                            BANKMASK(WPUB), 3, b
#define WPUB4                            BANKMASK(WPUB), 4, b
#define WPUB5                            BANKMASK(WPUB), 5, b
#define WPUB6                            BANKMASK(WPUB), 6, b
#define WPUB7                            BANKMASK(WPUB), 7, b
#define WPUC0                            BANKMASK(WPUC), 0, b
#define WPUC1                            BANKMASK(WPUC), 1, b
#define WPUC2                            BANKMASK(WPUC), 2, b
#define WPUC3                            BANKMASK(WPUC), 3, b
#define WPUC4                            BANKMASK(WPUC), 4, b
#define WPUC5                            BANKMASK(WPUC), 5, b
#define WPUC6                            BANKMASK(WPUC), 6, b
#define WPUC7                            BANKMASK(WPUC), 7, b
#define WPUD0                            BANKMASK(WPUD), 0, b
#define WPUD1                            BANKMASK(WPUD), 1, b
#define WPUD2                            BANKMASK(WPUD), 2, b
#define WPUD3                            BANKMASK(WPUD), 3, b
#define WPUD4                            BANKMASK(WPUD), 4, b
#define WPUD5                            BANKMASK(WPUD), 5, b
#define WPUD6                            BANKMASK(WPUD), 6, b
#define WPUD7                            BANKMASK(WPUD), 7, b
#define WPUE0                            BANKMASK(WPUE), 0, b
#define WPUE1                            BANKMASK(WPUE), 1, b
#define WPUE2                            BANKMASK(WPUE), 2, b
#define WPUE3                            BANKMASK(WPUE), 3, b
#define WR                               BANKMASK(NVMCON1), 1, a
#define WRE                              BANKMASK(PORTE), 1, a
#define WREN                             BANKMASK(NVMCON1), 2, a
#define WRERR                            BANKMASK(NVMCON1), 3, a
#define WUE1                             BANKMASK(BAUD1CON), 1, a
#define WUE2                             BANKMASK(BAUD2CON), 1, b
#define X1                               BANKMASK(CRCXORL), 1, a
#define X10                              BANKMASK(CRCXORH), 2, a
#define X11                              BANKMASK(CRCXORH), 3, a
#define X12                              BANKMASK(CRCXORH), 4, a
#define X13                              BANKMASK(CRCXORH), 5, a
#define X14                              BANKMASK(CRCXORH), 6, a
#define X15                              BANKMASK(CRCXORH), 7, a
#define X2                               BANKMASK(CRCXORL), 2, a
#define X3                               BANKMASK(CRCXORL), 3, a
#define X4                               BANKMASK(CRCXORL), 4, a
#define X5                               BANKMASK(CRCXORL), 5, a
#define X6                               BANKMASK(CRCXORL), 6, a
#define X7                               BANKMASK(CRCXORL), 7, a
#define X8                               BANKMASK(CRCXORH), 0, a
#define X9                               BANKMASK(CRCXORH), 1, a
